In [2]:
#Pandas series
#Creating empty series
import pandas as pd
#s=pd.Series(data,index,dtype,copy) ---------- Syntax
s=pd.Series()
print(s)

Series([], dtype: float64)

C:\Users\admin\AppData\Local\Temp/ipykernel_11892/2148162236.py:5: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  s=pd.Series()

In [3]:
#creating series from ndarray
import pandas as pd
import numpy as np
data=[1,2,3,4,5]
s=pd.Series(data)
print(s)
#if index is not passed bydefault index will be range(n) where n is array length-1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
#if index is specified then
import pandas as pd
import numpy as np
data=[1,2,3,4,5]
s=pd.Series(data,index=['a','b','c','d','e'])
print(s)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [6]:
#creating series from dict
import pandas as pd
import numpy as np
d={'a':10,'b':20,'c':30}
s=pd.Series(d)
print(s)

a    10
b    20
c    30
dtype: int64

In [7]:
import pandas as pd
import numpy as np
d={'a':10,'b':20,'c':30}
s=pd.Series(d,index=[1,2,3])
print(s)

1   NaN
2   NaN
3   NaN
dtype: float64

In [12]:
import pandas as pd
import numpy as np
d={'a':10,'b':20,'c':30,'d':40,'e':50}
s=pd.Series(d,index=['c','a','b','d','e'])
print(s)

c    30
a    10
b    20
d    40
e    50
dtype: int64

In [10]:
# Accessing data from Series
s[0]

30

In [13]:
s[:]

c    30
a    10
b    20
d    40
e    50
dtype: int64

In [14]:
s[:3]

c    30
a    10
b    20
dtype: int64

In [15]:
s[-4:-1]

a    10
b    20
d    40
dtype: int64

In [16]:
s[-3:]

b    20
d    40
e    50
dtype: int64

In [17]:
#retreieving single data using index/label
s['e']

50

In [20]:
#retrieving multiple values
s[['d','e']]

d    40
e    50
dtype: int64

In [22]:
#DATAFRAME
#creating an empty dataframe
import pandas as pd
df=pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [25]:
#creating dataframe feom list
import pandas as pd
li=[1,2,3,4,5]
#df=pd.DataFrame(li)
df=pd.DataFrame(li,index=['a','b','c','d','e'])
print(df)

   0
a  1
b  2
c  3
d  4
e  5

In [2]:
import pandas as pd
data=[["Rohit",32],["Deepali",32],["Rudu",0.8]]
#df=pd.DataFrame(data)
df=pd.DataFrame(data,columns=['Name','Age'],index=[1,2,3])
print(df)

      Name   Age
1    Rohit  32.0
2  Deepali  32.0
3     Rudu   0.8

In [33]:
#Dataframe from dict of ndarrays/ list
data={
      
    'Name':['Josh','Mel','Andy'],
    'Age': [45,23,42]    
    
}
df=pd.DataFrame(data)
print(df)

   Name  Age
0  Josh   45
1   Mel   23
2  Andy   42

In [34]:
# Dataframe form list of dict
import pandas  as pd
data=[{'Deep':32,"Rohu":31},{"Rudu":3,"Dyanu":1}]
df=pd.DataFrame(data)
print(df)

   Deep  Rohu  Rudu  Dyanu
0  32.0  31.0   NaN    NaN
1   NaN   NaN   3.0    1.0

In [38]:
#Dataframe for dict of series

data={
    
    "one":pd.Series([1,2,3]),
    "Two":pd.Series([1,2,3,4])
    
}
df=pd.DataFrame(data)
print(df)

   one  Two
0  1.0    1
1  2.0    2
2  3.0    3
3  NaN    4

In [40]:
#adding new column 
df['Three']=pd.Series([5,6,7,8])
print(df)

   one  Two  Three
0  1.0    1      5
1  2.0    2      6
2  3.0    3      7
3  NaN    4      8

In [41]:
df["Four"]=df["one"]+df["Two"]
print(df)

   one  Two  Three  Four
0  1.0    1      5   2.0
1  2.0    2      6   4.0
2  3.0    3      7   6.0
3  NaN    4      8   NaN

In [42]:
#deleting column from dataframe
#  1. del() function -------del df['col name']
#  2. pop() function -------pop.df['col name']

In [43]:
del df['one']
print(df)

   Two  Three  Four
0    1      5   2.0
1    2      6   4.0
2    3      7   6.0
3    4      8   NaN

In [45]:
df.pop('Four')

0    2.0
1    4.0
2    6.0
3    NaN
Name: Four, dtype: float64

In [46]:
print(df)

   Two  Three
0    1      5
1    2      6
2    3      7
3    4      8

In [3]:
#Row selectio y label------------   loc()
# Rows can be selected by passing row label to a loc function.
import pandas as pd
data={'one':pd.Series([1,2,3],index=['a','b','c']),
      'Two':pd.Series([1,2,3,4],index=['a','b','c','d'] )}
df=pd.DataFrame(data)
print(df)
print(df.loc['b'])

   one  Two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4
one    2.0
Two    2.0
Name: b, dtype: float64

In [52]:
#iloc()---- Passing integer location to iloc() function
print(df)

   one  Two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [53]:
print(df.iloc[2])

one    3.0
Two    3.0
Name: c, dtype: float64

In [4]:
#Slicing rows---------- Multiple rows can be selected using ‘ : ’ operator.
print(df[:])

   one  Two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [6]:
print(df[2:4])

   one  Two
c  3.0    3
d  NaN    4

In [63]:
#Addition of Rows-------------- append()
df1=pd.DataFrame([[1,2],[3,4]],columns=['a','b'])
df2=pd.DataFrame([[5,6],[7,8]],columns=['a','b'])
df1=df1.append(df2)
print(df1)

   a  b
0  1  2
1  3  4
0  5  6
1  7  8

In [61]:
df=pd.DataFrame([[1,2,3],[4,5]])
df1=pd.DataFrame([[6,7],[8,9,10]])
df=df.append(df1)
print(df)

   0  1     2
0  1  2   3.0
1  4  5   NaN
0  6  7   NaN
1  8  9  10.0

In [64]:
#deleting from dataframe
# Use index label to delete or drop rows from a DataFrame. If label is duplicated, then multiple rows will be dropped.
res=df.drop(0)
print(res)

   0  1     2
1  4  5   NaN
1  8  9  10.0

In [65]:
#Pandas Panel--- A panel is a 3D container of data

In [66]:
#creating empty panel
#   pandas.Panel(data, items, major_axis, minor_axis, dtype, copy)

In [72]:
#Basic Functioality of Series
import pandas as pd
import numpy as np
data=pd.Series(np.random.rand(10))
print(data)

0    0.115309
1    0.923570
2    0.044802
3    0.834031
4    0.775903
5    0.956449
6    0.815267
7    0.989230
8    0.004914
9    0.576033
dtype: float64

In [73]:
#Returns the list of the labels of the series.
data.axes

[RangeIndex(start=0, stop=10, step=1)]

In [84]:
#empty
#Returns the Boolean value saying whether the Object is empty or not. True indicates that the object is empty.
import pandas as pd
import numpy as np
data=pd.Series(np.random.rand(10))
data.empty

False

In [75]:
import pandas as pd
import numpy as np
data=pd.Series()
data.empty

C:\Users\admin\AppData\Local\Temp/ipykernel_11892/2432975612.py:3: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  data=pd.Series()

True

In [79]:
#ndim
#Returns the number of dimensions of the object. By definition, a Series is a 1D data structure, so it returns
data.ndim

1

In [82]:
#size
#Returns the size(length) of the series
import pandas as pd
import numpy as np
data=pd.Series(np.random.rand(3))
data.size

3

In [86]:
#values
#Returns the actual data in the series as an array.
import pandas as pd
import numpy as np
data=pd.Series(np.random.rand(3))
print(data.values)

[0.18770297 0.85802174 0.28585058]

In [89]:
# head() returns the first n rows
# tail() returns the last n rows
import pandas as pd
import numpy as np
data=[1,2,3,4,5,6,7,8,9,10,11,12,13]
s=pd.Series(data)
print(s.head())
print(s.tail())

0    1
1    2
2    3
3    4
4    5
dtype: int64
8      9
9     10
10    11
11    12
12    13
dtype: int64

In [ ]:
#Basic Functionality of Dataframe
'''
1. Transpose ------Transposes rows and columns.
2.axes  ------Returns a list with the row axis labels and column axis labels as the only members.
3.dtypes -- Returns the data type of each column.
4.empty ---- Returns the Boolean value saying whether the Object is empty or not; True indicates that the object is empty.
5.ndim ----Returns the number of dimensions of the object. By definition, DataFrame is a 2D object.
6.shape ---Tuple (a,b), where a represents the number of rows and b represents the number of columns.
7.size -----Returns the number of elements in the DataFrame.
8.values ----- Returns the actual data in the DataFrame as an NDarray.
9.head()---- first n rows
10.tail() --------last n rows
'''

In [90]:
# Create dataframe from dict of series

In [91]:
import pandas as pd
import numpy as np
data={
    'Name':pd.Series(['Rudu','Dyanu','Devu','Bhargav']),
    'Age' :pd.Series([1,2,3,4])
}
df=pd.DataFrame(data)
print(df)

      Name  Age
0     Rudu    1
1    Dyanu    2
2     Devu    3
3  Bhargav    4

In [92]:
df.T

         0      1     2        3
Name  Rudu  Dyanu  Devu  Bhargav
Age      1      2     3        4

In [94]:
df.axes

[RangeIndex(start=0, stop=4, step=1), Index(['Name', 'Age'], dtype='object')]

In [96]:
df.dtypes

Name    object
Age      int64
dtype: object

In [97]:
df.empty

False

In [98]:
df.ndim

2

In [99]:
df.shape

(4, 2)

In [100]:
df.size

8

In [101]:
df.values

array([['Rudu', 1],
       ['Dyanu', 2],
       ['Devu', 3],
       ['Bhargav', 4]], dtype=object)

In [104]:
df.head(2)

    Name  Age
0   Rudu    1
1  Dyanu    2

In [105]:
df.tail(2)

      Name  Age
2     Devu    3
3  Bhargav    4

In [160]:
df

      Name  Age  Rating
a     Rudu    1      23
b    Dyanu    2      43
c     Devu    3      65
d  Bhargav    4      12

In [151]:
# sum() ---- Returns the sum of the values for the requested axis. By default, axis is index (axis=0).-- column wise
#            if axis=1 -------print df.sum(1)----row wise addition

#mean()      -----Returns the average value
#std()      ------- Returns the Bressel standard deviation of the numerical columns.


import pandas as pd
import numpy as np
data={
    'Name':pd.Series(['Rudu','Dyanu','Devu','Bhargav'],index=['a','b','c','d']),
    'Age' :pd.Series([1,2,3,4],index=['a','b','c','d']),
    'Rating':pd.Series([23,43,65,12],index=['a','b','c','d'])
}
df=pd.DataFrame(data)
print(df)
df.sum()

      Name  Age  Rating
a     Rudu    1      23
b    Dyanu    2      43
c     Devu    3      65
d  Bhargav    4      12

Name      RuduDyanuDevuBhargav
Age                         10
Rating                     143
dtype: object

In [152]:
#axix=0 column wise sum
df.sum(axis=0)

Name      RuduDyanuDevuBhargav
Age                         10
Rating                     143
dtype: object

In [153]:
#axis=1 rowwise sum
df.sum(axis=1)

C:\Users\admin\AppData\Local\Temp/ipykernel_11892/526948045.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.sum(axis=1)

a    24
b    45
c    68
d    16
dtype: int64

In [159]:
df.loc['a']      #or df.iloc[0]

Name      Rudu
Age          1
Rating      23
Name: a, dtype: object

In [161]:
df.mean(axis=0)      #colum wise mean

C:\Users\admin\AppData\Local\Temp/ipykernel_11892/2681518468.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean(axis=0)

Age        2.50
Rating    35.75
dtype: float64

In [162]:
df.mean(axis=1)         #row wise mean

C:\Users\admin\AppData\Local\Temp/ipykernel_11892/622704754.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean(axis=1)

a    12.0
b    22.5
c    34.0
d     8.0
dtype: float64

In [163]:
df.mean()          #by default column wise mean will get calculated

C:\Users\admin\AppData\Local\Temp/ipykernel_11892/3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

Age        2.50
Rating    35.75
dtype: float64

In [165]:
df.std()

C:\Users\admin\AppData\Local\Temp/ipykernel_11892/3390915376.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.std()

Age        1.290994
Rating    23.343450
dtype: float64

In [166]:
#describe() ----- computes a summary of statistics pertaining to the DataFrame columns.
df.describe()

            Age    Rating
count  4.000000   4.00000
mean   2.500000  35.75000
std    1.290994  23.34345
min    1.000000  12.00000
25%    1.750000  20.25000
50%    2.500000  33.00000
75%    3.250000  48.50000
max    4.000000  65.00000

In [172]:
#  object − Summarizes String columns
#  number − Summarizes Numeric columns
#  all − Summarizes all columns together (Should not pass it as a list value)


df.describe(include=[object])

        Name
count      4
unique     4
top     Rudu
freq       1

In [171]:
df.describe(include='all')

        Name       Age    Rating
count      4  4.000000   4.00000
unique     4       NaN       NaN
top     Rudu       NaN       NaN
freq       1       NaN       NaN
mean     NaN  2.500000  35.75000
std      NaN  1.290994  23.34345
min      NaN  1.000000  12.00000
25%      NaN  1.750000  20.25000
50%      NaN  2.500000  33.00000
75%      NaN  3.250000  48.50000
max      NaN  4.000000  65.00000

In [174]:
''' 
1. count()	Number of non-null observations
2	sum()	Sum of values
3	mean()	Mean of Values
4	median()	Median of Values
5	mode()	Mode of values
6	std()	Standard Deviation of the Values
7	min()	Minimum Value
8	max()	Maximum Value
9	abs()	Absolute Value
10	prod()	Product of Values
11	cumsum()	Cumulative Sum
12	cumprod()	Cumulative Product
'''
df.count()

Name      4
Age       4
Rating    4
dtype: int64

In [175]:
df.median()

C:\Users\admin\AppData\Local\Temp/ipykernel_11892/530051474.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.median()

Age        2.5
Rating    33.0
dtype: float64

In [176]:
df.mode()

      Name  Age  Rating
0  Bhargav    1      12
1     Devu    2      23
2    Dyanu    3      43
3     Rudu    4      65

In [177]:
df.min()

Name      Bhargav
Age             1
Rating         12
dtype: object

In [202]:
# Functions
# The appropriate method to use depends on whether your function expects to operate on an entire DataFrame, row- or 
#column-wise, or element wise.

# 1. Table wise Function Application:                     pipe()
# 2. Row or Column Wise Function Application:             apply()
# 3. Element wise Function Application:                   applymap()---dataframe    or map()-- series


import pandas as pd
import numpy as np

def adder(ele1,ele2):
    return ele1+ele2 

df=pd.DataFrame(np.random.rand(5,3),columns=['col1','col2','col3'])
print(df)
print(df.pipe(adder,5) )       #----- ele1 will be each dataframe elemnent ,ele2 will be 5
print(df.apply(np.mean))       #----- apply() will get applied to each column

       col1      col2      col3
0  0.645032  0.368105  0.879320
1  0.983438  0.114039  0.085976
2  0.692233  0.110654  0.199343
3  0.996592  0.712997  0.803977
4  0.577335  0.734827  0.935101
       col1      col2      col3
0  5.645032  5.368105  5.879320
1  5.983438  5.114039  5.085976
2  5.692233  5.110654  5.199343
3  5.996592  5.712997  5.803977
4  5.577335  5.734827  5.935101
col1    0.778926
col2    0.408124
col3    0.580743
dtype: float64

In [ ]:
#apply () method

In [226]:
import pandas as pd
import numpy as np

def cal(x):
    if x>5 and x>0:
        return 1
    else:
        return 2
df=pd.DataFrame(data={'col1':[1,4,5,7],'col2':[5,2,4,-]})
df['col2']=df['col2'].apply(cal)
print(df)


# df=pd.DataFrame(data={0:[1,4,5,7],1:[5,2,4,8]})
for i in df:
    print(df[i].apply(cal))

   col1  col2
0     1     2
1     4     2
2     5     2
3     7     1
0    2
1    2
2    2
3    1
Name: col1, dtype: int64
0    2
1    2
2    2
3    2
Name: col2, dtype: int64

In [ ]:
# applymap() -------accept any Python function taking a single value and returning a single value.

In [231]:
#map() is a method of Series, applymap() is a method of DataFrame

In [244]:
import pandas as pd
import numpy as np


def mul(ele1):
    return ele1*100

# My custom function
df = pd.DataFrame(np.random.randn(5,3),columns=['col1','col2','col3'])
print(df)
df1=df.applymap(lambda x:x*100)              # applymap() each element off df applied x*100
print(df1)
print(df.pipe(mul))

       col1      col2      col3
0 -1.115242 -0.175701  0.402047
1  1.690196 -0.050704  0.860048
2  1.242648 -0.699899 -1.453246
3  0.622187  2.812459 -0.442447
4  0.572061  0.394459 -0.122118
         col1        col2        col3
0 -111.524236  -17.570078   40.204667
1  169.019613   -5.070352   86.004775
2  124.264836  -69.989948 -145.324567
3   62.218695  281.245901  -44.244690
4   57.206099   39.445869  -12.211824
         col1        col2        col3
0 -111.524236  -17.570078   40.204667
1  169.019613   -5.070352   86.004775
2  124.264836  -69.989948 -145.324567
3   62.218695  281.245901  -44.244690
4   57.206099   39.445869  -12.211824

In [245]:
# Reindexing ------Reindexing changes the row labels and column labels of a DataFrame
#Reorder the existing data to match a new set of labels.
#Insert missing value (NA) markers in label locations where no data for the label existed.

In [2]:
import pandas as pd
import numpy as np

N=20

df = pd.DataFrame({
   'A': pd.date_range(start='2016-01-01',periods=N,freq='D'),
   'x': np.linspace(0,stop=N-1,num=N),
   'y': np.random.rand(N),
   'C': np.random.choice(['Low','Medium','High'],N).tolist(),
   'D': np.random.normal(100, 10, size=(N)).tolist()
})
print(df)
df_reindex=df.reindex(index=(0,2,5,7,9,13,17),columns=['A','E','B'])
print(df_reindex)

            A     x         y       C           D
0  2016-01-01   0.0  0.414872    High   89.161590
1  2016-01-02   1.0  0.022255  Medium  105.902368
2  2016-01-03   2.0  0.471175    High   96.804548
3  2016-01-04   3.0  0.363258     Low  100.485030
4  2016-01-05   4.0  0.554652    High  111.002977
5  2016-01-06   5.0  0.981111    High   90.511365
6  2016-01-07   6.0  0.216629    High  110.002614
7  2016-01-08   7.0  0.959872  Medium  111.757696
8  2016-01-09   8.0  0.619658     Low   86.273048
9  2016-01-10   9.0  0.876903     Low   98.373509
10 2016-01-11  10.0  0.910821     Low  108.961644
11 2016-01-12  11.0  0.248003     Low   91.697280
12 2016-01-13  12.0  0.067666  Medium  100.672585
13 2016-01-14  13.0  0.464876    High   89.169638
14 2016-01-15  14.0  0.431245  Medium   87.094576
15 2016-01-16  15.0  0.142333     Low   98.257790
16 2016-01-17  16.0  0.786158     Low   90.478600
17 2016-01-18  17.0  0.086575     Low   84.633895
18 2016-01-19  18.0  0.385197  Medium   96.273838
19 2016-01-20  19.0  0.827152  Medium  104.986986
            A   E   B
0  2016-01-01 NaN NaN
2  2016-01-03 NaN NaN
5  2016-01-06 NaN NaN
7  2016-01-08 NaN NaN
9  2016-01-10 NaN NaN
13 2016-01-14 NaN NaN
17 2016-01-18 NaN NaN

In [273]:
#index_like
import pandas as pd
import numpy as np

df1=pd.DataFrame(np.random.randn(7,3),columns=['c1','c2','c3'])
df2=pd.DataFrame(np.random.randn(3,3),columns=['c1','c2','c3'])
print(df1)
print(df2)
df2=df2.reindex_like(df1)
print(df2)

         c1        c2        c3
0 -1.382812  0.733687 -0.846825
1 -2.242804  1.095152  0.428268
2 -0.258804  0.384533  2.116867
3 -0.668579  0.663003 -0.076762
4 -0.137396 -0.943944  0.844609
5 -0.823468  0.259482 -0.448273
6  0.121529  0.774885  1.772265
         c1        c2        c3
0 -1.338300  0.224505  1.710089
1  0.801065  1.859070 -0.500688
2  0.004733 -0.491261 -0.128372
         c1        c2        c3
0 -1.338300  0.224505  1.710089
1  0.801065  1.859070 -0.500688
2  0.004733 -0.491261 -0.128372
3       NaN       NaN       NaN
4       NaN       NaN       NaN
5       NaN       NaN       NaN
6       NaN       NaN       NaN

In [286]:
#filling while reindexing

#reindex() takes an optional parameter method which is a filling method with values as follows −
#pad/ffill − Fill values forward
#bfill/backfill − Fill values backward
#nearest − Fill from the nearest index values

import pandas as pd
import numpy as np

df1=pd.DataFrame(np.random.randn(7,3),columns=['c1','c2','c3'])
df2=pd.DataFrame(np.random.randn(3,3),columns=['c1','c2','c3'])
print(df1)
print(df2)
df2=df2.reindex_like(df1,method='ffill')                     # forward filling
                                  #climit argument provides additional control over filling while reindexing. 
                                  #Limit specifies the maximum count of consecutive matches.
print(df2)

         c1        c2        c3
0  0.132652  0.547930 -0.452061
1  1.082287  0.080587 -0.552462
2  0.507173  0.279258  0.254136
3 -0.583445  0.725751  1.585038
4 -0.083846  1.226754 -0.559658
5 -0.272941 -0.855842 -0.044444
6  0.107254  0.306861  0.783941
         c1        c2        c3
0  0.496278  0.488349 -0.119763
1 -0.562349  1.204726  0.328871
2  0.553167 -0.209548 -0.530794
         c1        c2        c3
0  0.496278  0.488349 -0.119763
1 -0.562349  1.204726  0.328871
2  0.553167 -0.209548 -0.530794
3  0.553167 -0.209548 -0.530794
4  0.553167 -0.209548 -0.530794
5       NaN       NaN       NaN
6       NaN       NaN       NaN

In [342]:
import pandas as pd
import numpy as np

df1=pd.DataFrame(np.random.randn(7,3),columns=['c1','c2','c3'])
df2=pd.DataFrame(np.random.randn(3,3),columns=['c1','c2','c3'])
print(df1)
print(df2)
df1=df1.reindex_like(df2,method='bfill')                  #backward filling
print(df1)

         c1        c2        c3
0 -1.183918 -0.649770  0.329317
1  2.540755 -0.395729 -1.207093
2  1.614943  1.237131 -0.333096
3 -0.928191 -0.725532 -0.678545
4  0.484012  2.907334  1.297529
5  0.235144  0.037637 -1.636313
6  0.664359  0.288335  1.200300
         c1        c2        c3
0  1.317586  2.365947 -1.070471
1  0.041368 -0.823702  0.723699
2 -1.041702 -0.903337 -0.549615
         c1        c2        c3
0 -1.183918 -0.649770  0.329317
1  2.540755 -0.395729 -1.207093
2  1.614943  1.237131 -0.333096

In [294]:
#renaming
import pandas as pd
import numpy as np
df=pd.DataFrame(np.random.randn(5,3),columns=['c1','c2','c3'])
print(df)                
print(df.rename(columns={'c1':'col1','c2':'col2','c3':'col3'}))
print(df.rename(columns={'c1':'col1','c2':'col2','c3':'col3'},index={0:'I',1:'II',2:'III',3:'IV',4:'V'}))

         c1        c2        c3
0 -0.640150 -0.255702  0.766310
1  1.067536 -1.019374 -1.734169
2  0.666612 -0.662193  1.346337
3  0.819937  0.816627 -1.441777
4 -0.077951  0.897604  0.110978
       col1      col2      col3
0 -0.640150 -0.255702  0.766310
1  1.067536 -1.019374 -1.734169
2  0.666612 -0.662193  1.346337
3  0.819937  0.816627 -1.441777
4 -0.077951  0.897604  0.110978
         col1      col2      col3
I   -0.640150 -0.255702  0.766310
II   1.067536 -1.019374 -1.734169
III  0.666612 -0.662193  1.346337
IV   0.819937  0.816627 -1.441777
V   -0.077951  0.897604  0.110978

In [340]:
import pandas as pd
import numpy as np

df = pd.DataFrame({
   'Name': ['Pooja','Abhay','Deepali','Sagar','Dyanu'],
   'Age': [23,21,33,45,21],
   'Sex': ['F','M','F','M','M'],
   'Marks':[45,56,74,87,67],
   'Address': ['Kop','Pune','Sangali','Jath','Mumbai']
})
print(df)
df_reindex=df.reindex(index=[0,1,2],columns=['Name','Address','Eligibilty'])
print(df_reindex)

      Name  Age Sex  Marks  Address
0    Pooja   23   F     45      Kop
1    Abhay   21   M     56     Pune
2  Deepali   33   F     74  Sangali
3    Sagar   45   M     87     Jath
4    Dyanu   21   M     67   Mumbai
      Name  Address  Eligibilty
0    Pooja      Kop         NaN
1    Abhay     Pune         NaN
2  Deepali  Sangali         NaN

In [303]:
# Iterating over dataframe   ------Iterating a DataFrame gives column names. 
'''
To iterate over the rows of the DataFrame, we can use the following functions −

    iteritems() − to iterate over the (key,value) pairs

    iterrows() − iterate over the rows as (index,series) pairs

    itertuples() − iterate over the rows as namedtuples

'''
import pandas as pd
import numpy as np

df = pd.DataFrame({
   'Name': ['Pooja','Abhay','Deepali','Sagar','Dyanu'],
   'Age': [23,21,33,45,21],
   'Sex': ['F','M','F','M','M'],
   'Marks':[45,56,74,87,67],
   'Address': ['Kop','Pune','Sangali','Jath','Mumbai']
})
print(df)
for i in df:                             #iterting over df gives column names
    print(i)

      Name  Age Sex  Marks  Address
0    Pooja   23   F     45      Kop
1    Abhay   21   M     56     Pune
2  Deepali   33   F     74  Sangali
3    Sagar   45   M     87     Jath
4    Dyanu   21   M     67   Mumbai
Name
Age
Sex
Marks
Address

In [306]:
#iteritems()
#Iterates over each column as key, value pair with label as key and column value as a Series object.

import pandas as pd
import numpy as np

df = pd.DataFrame({
   'Name': ['Pooja','Abhay','Deepali','Sagar','Dyanu'],
   'Age': [23,21,33,45,21],
   'Sex': ['F','M','F','M','M'],
   'Marks':[45,56,74,87,67],
   'Address': ['Kop','Pune','Sangali','Jath','Mumbai']
})
print(df)
for i,j in df.iteritems():
    print("\n",i,"\t",j)

      Name  Age Sex  Marks  Address
0    Pooja   23   F     45      Kop
1    Abhay   21   M     56     Pune
2  Deepali   33   F     74  Sangali
3    Sagar   45   M     87     Jath
4    Dyanu   21   M     67   Mumbai

 Name 	 0      Pooja
1      Abhay
2    Deepali
3      Sagar
4      Dyanu
Name: Name, dtype: object

 Age 	 0    23
1    21
2    33
3    45
4    21
Name: Age, dtype: int64

 Sex 	 0    F
1    M
2    F
3    M
4    M
Name: Sex, dtype: object

 Marks 	 0    45
1    56
2    74
3    87
4    67
Name: Marks, dtype: int64

 Address 	 0        Kop
1       Pune
2    Sangali
3       Jath
4     Mumbai
Name: Address, dtype: object

In [312]:
#iterrows()
#iterrows() returns the iterator yielding each index value along with a series containing the data in each row.
import pandas as pd
import numpy as np

df = pd.DataFrame({
   'Name': ['Pooja','Abhay','Deepali','Sagar','Dyanu'],
   'Age': [23,21,33,45,21],
   'Sex': ['F','M','F','M','M'],
   'Marks':[45,56,74,87,67],
   'Address': ['Kop','Pune','Sangali','Jath','Mumbai']
})
print(df,"\n")
for row_index,row in df.iterrows():
    print(row_index,row)

      Name  Age Sex  Marks  Address
0    Pooja   23   F     45      Kop
1    Abhay   21   M     56     Pune
2  Deepali   33   F     74  Sangali
3    Sagar   45   M     87     Jath
4    Dyanu   21   M     67   Mumbai

0 Name       Pooja
Age           23
Sex            F
Marks         45
Address      Kop
Name: 0, dtype: object
1 Name       Abhay
Age           21
Sex            M
Marks         56
Address     Pune
Name: 1, dtype: object
2 Name       Deepali
Age             33
Sex              F
Marks           74
Address    Sangali
Name: 2, dtype: object
3 Name       Sagar
Age           45
Sex            M
Marks         87
Address     Jath
Name: 3, dtype: object
4 Name        Dyanu
Age            21
Sex             M
Marks          67
Address    Mumbai
Name: 4, dtype: object

In [313]:
#itertuples()
#itertuples() method will return an iterator yielding a named tuple for each row in the DataFrame.

import pandas as pd
import numpy as np

df = pd.DataFrame({
   'Name': ['Pooja','Abhay','Deepali','Sagar','Dyanu'],
   'Age': [23,21,33,45,21],
   'Sex': ['F','M','F','M','M'],
   'Marks':[45,56,74,87,67],
   'Address': ['Kop','Pune','Sangali','Jath','Mumbai']
})
print(df,"\n")
for index in df.itertuples():
    print(index)

      Name  Age Sex  Marks  Address
0    Pooja   23   F     45      Kop
1    Abhay   21   M     56     Pune
2  Deepali   33   F     74  Sangali
3    Sagar   45   M     87     Jath
4    Dyanu   21   M     67   Mumbai

Pandas(Index=0, Name='Pooja', Age=23, Sex='F', Marks=45, Address='Kop')
Pandas(Index=1, Name='Abhay', Age=21, Sex='M', Marks=56, Address='Pune')
Pandas(Index=2, Name='Deepali', Age=33, Sex='F', Marks=74, Address='Sangali')
Pandas(Index=3, Name='Sagar', Age=45, Sex='M', Marks=87, Address='Jath')
Pandas(Index=4, Name='Dyanu', Age=21, Sex='M', Marks=67, Address='Mumbai')

In [325]:
#sorting
# 1. by Label
# 2. by actual value



#Using the sort_index() method, by passing the axis arguments and the order of sorting, DataFrame can be sorted. 
#By default, sorting is done on row labels in ascending order.

import pandas as pd
import numpy as np

unsorted_df=pd.DataFrame([34,5,66,43,54,22,12,55,12,33],index=[1,12,31,14,5,16,7,8,9,10],columns=['col1'])
print(unsorted_df)
sorted_df=unsorted_df.sort_index()
print(sorted_df)
descending_df=unsorted_df.sort_index(ascending=False)
print(descending_df)

    col1
1     34
12     5
31    66
14    43
5     54
16    22
7     12
8     55
9     12
10    33
    col1
1     34
5     54
7     12
8     55
9     12
10    33
12     5
14    43
16    22
31    66
    col1
31    66
16    22
14    43
12     5
10    33
9     12
8     55
7     12
5     54
1     34

In [333]:
# by value
#Like index sorting, sort_values() is the method for sorting by values.
#It accepts a 'by' argument which will use the column name of the DataFrame with which the values are to be sorted.

import pandas as pd
import numpy as np

df=pd.DataFrame(
             {
                 'col1':[23,12,3,67,0,9],
                 'col2':[667,34,5,2,99,1]
             }
,index=[1,2,3,4,5,6])
print(df)
sorted_df=df.sort_values(by='col1')

#sorted_df=df.sort_values(by=['col1','col2'])     
#----Observe, col1 values are sorted and the respective col2 value and row index will alter along with col1. Thus, they look unsorted.


print(sorted_df)

   col1  col2
1    23   667
2    12    34
3     3     5
4    67     2
5     0    99
6     9     1
   col1  col2
5     0    99
3     3     5
6     9     1
2    12    34
1    23   667
4    67     2

In [334]:
#sort_values() provides a provision to choose the algorithm from mergesort, heapsort and quicksort. 
#Mergesort is the only stable algorithm.

import pandas as pd
import numpy as np

df=pd.DataFrame(
             {
                 'col1':[23,12,3,67,0,9],
                 'col2':[667,34,5,2,99,1]
             }
,index=[1,2,3,4,5,6])
print(df)
sorted_df=df.sort_values(by='col1',kind='mergesort')
print(sorted_df)

   col1  col2
1    23   667
2    12    34
3     3     5
4    67     2
5     0    99
6     9     1
   col1  col2
5     0    99
3     3     5
6     9     1
2    12    34
1    23   667
4    67     2

In [339]:
#working with text data

''' String Functions 

1.lower()--------- Converts strings in the Series/Index to lower case.

2. upper()-----Converts strings in the Series/Index to upper case.

3 len()---------- Computes String length().

4 strip()----------Helps strip whitespace(including newline) from each string in the Series/index from both the sides.

5. split(' ')--------Splits each string with the given pattern.

6. cat(sep=' ')---------------Concatenates the series/index elements with given separator.

7. get_dummies()---------------Returns the DataFrame with One-Hot Encoded values.

8. contains(pattern)-----Returns a Boolean value True for each element if the substring contains in the element, else False.

9. replace(a,b)-------------------------------Replaces the value a with the value b.

10. repeat(value)-------------------Repeats each element with specified number of times.

11. count(pattern)-------Returns count of appearance of pattern in each element.

12. startswith(pattern)------------Returns true if the element in the Series/Index starts with the pattern.

13. endswith(pattern)--------Returns true if the element in the Series/Index ends with the pattern.

14.find(pattern)-------------Returns the first position of the first occurrence of the pattern.

15. findall(pattern)------------Returns a list of all occurrence of the pattern.

16. swapcase-----------------Swaps the case lower/upper.

17. islower()------------Checks whether all characters in each string in the Series/Index in lower case or not. Returns Boolean

18. isupper()---------------------------Checks whether all characters in each string in the Series/Index in upper case or not. Returns Boolean.

19. isnumeric()------------Checks whether all characters in each string in the Series/Index are numeric. Returns Boolean.'''
print(__doc__)

 String Functions

1.lower()--------- Converts strings in the Series/Index to lower case.

2. upper()-----Converts strings in the Series/Index to upper case.

3 len()---------- Computes String length().

4 strip()----------Helps strip whitespace(including newline) from each string in the Series/index from both the sides.

5. split(' ')--------Splits each string with the given pattern.

6. cat(sep=' ')---------------Concatenates the series/index elements with given separator.

7. get_dummies()---------------Returns the DataFrame with One-Hot Encoded values.

8. contains(pattern)-----Returns a Boolean value True for each element if the substring contains in the element, else False.

9. replace(a,b)-------------------------------Replaces the value a with the value b.

10. repeat(value)-------------------Repeats each element with specified number of times.

11. count(pattern)-------Returns count of appearance of pattern in each element.

12. startswith(pattern)------------Returns true if the element in the Series/Index starts with the pattern.

13. endswith(pattern)--------Returns true if the element in the Series/Index ends with the pattern.

14.find(pattern)-------------Returns the first position of the first occurrence of the pattern.

15. findall(pattern)------------Returns a list of all occurrence of the pattern.

16. swapcase-----------------Swaps the case lower/upper.

17. islower()------------Checks whether all characters in each string in the Series/Index in lower case or not. Returns Boolean

18. isupper()---------------------------Checks whether all characters in each string in the Series/Index in upper case or not. Returns Boolean.

19. isnumeric()------------Checks whether all characters in each string in the Series/Index are numeric. Returns Boolean.

In [2]:
import pandas as pd
df=pd.read_csv("C:\\Users\\admin\\OneDrive\\Desktop\\train.csv")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [3]:
len(df.index)

891

In [5]:
len(df.columns)

12

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [7]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [28]:
df[df['Sex']=='male']['Sex'].count()

577

In [35]:
df.groupby('Sex').agg({'Fare':'mean'})

             Fare
Sex
female  44.479818
male    25.523893

In [43]:
df[df['Age']>18]['PassengerId'].count()

575

In [44]:
 #How many people have American Express as their Credit Card Provider *and made a purchase above $95 ?**
df[df['Sex']=='male'][df['Age']>25].count()

C:\Users\admin\AppData\Local\Temp\ipykernel_13484\903820574.py:2: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  df[df['Sex']=='male'][df['Age']>25].count()

PassengerId    274
Survived       274
Pclass         274
Name           274
Sex            274
Age            274
SibSp          274
Parch          274
Ticket         274
Fare           274
Cabin           76
Embarked       274
dtype: int64